
Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетЗаказСПечатью") Тогда
		ТаблицаСведенийСчетНаОплату = Документы.СчетНаОплатуПокупателю.ПолучитьТаблицуСведенийСчетаНаОплату(МассивОбъектов);
		ТабличныйДокумент = ПечатьТорговыхДокументов.ПечатьСчетаНаОплату(ТаблицаСведенийСчетНаОплату, ОбъектыПечати, Истина);
		
		// + Граховский К.Н. 2016.03.31
		Область = ТабличныйДокумент.НайтиТекст("Санкт-Петербургский филиал АО ""СОГАЗ""");
		Если Область <> Неопределено Тогда
			Область.Текст = "АО ""СОГАЗ"", ИНН 7736035485, КПП 784143002, 107078, г. Москва,проспект Академика Сахарова, д.10";
		КонецЕсли;
		
		Область = ТабличныйДокумент.НайтиТекст("Сумма");
		Если Область <> Неопределено Тогда
			НомерСтроки = Область.Верх + 1;
			НомерСтолбца = Область.Лево;
			Пока ТабличныйДокумент.Область(НомерСтроки, НомерСтолбца, НомерСтроки, НомерСтолбца).Текст <> "" Цикл
				ТабличныйДокумент.Область(НомерСтроки, НомерСтолбца - 3, НомерСтроки, НомерСтолбца - 3).Текст = "--";
				ТабличныйДокумент.Область(НомерСтроки, НомерСтолбца - 2, НомерСтроки, НомерСтолбца - 2).Текст = "--";
				ТабличныйДокумент.Область(НомерСтроки, НомерСтолбца - 1, НомерСтроки, НомерСтолбца - 1).Текст = 
				ТабличныйДокумент.Область(НомерСтроки, НомерСтолбца, НомерСтроки, НомерСтолбца).Текст;
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
		КонецЕсли;
		// - Граховский К.Н. 2016.03.31
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетЗаказСПечатью", "Счет на оплату", 
			ТабличныйДокумент,,"ОбщийМакет.ПФ_MXL_СчетЗаказ");
		ПараметрыВывода.Вставить("ФормироватьЭД", Истина);
	КонецЕсли;

КонецПроцедуры // Печать

#Область ПодключениеКДополнительнымОтчетамИОбработкам

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.3.1"); 
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
    ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.Наименование = "Счет на оплату (ММЦ)";
	ПараметрыРегистрации.Информация = "Счет на оплату (ММЦ)";
    ПараметрыРегистрации.БезопасныйРежим = Ложь; 
    ПараметрыРегистрации.Назначение.Добавить("Документ.СчетНаОплатуПокупателю");
    //
    НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = "Счет на оплату (ММЦ)";
    НоваяКоманда.Идентификатор = "СчетЗаказСПечатью";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;
    НоваяКоманда.Модификатор = "ПечатьMXL";

    Возврат ПараметрыРегистрации;
	
  
КонецФункции

#КонецОбласти



