
&НаКлиенте
Процедура Печать(Команда)
	
	ПечатьНаСервере().Показать();
	
КонецПроцедуры

Функция ПечатьНаСервере()
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокументСсылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений();
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	СтрокаКоллекцияПечатныхФорм = КоллекцияПечатныхФорм.Добавить();
	СтрокаКоллекцияПечатныхФорм.ИмяВРЕГ = ВРЕГ("СчетЗаказСПечатью");
	
	РеквизитФормыВЗначение("Объект").Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, Новый Структура("ДоступнаПечатьПоКомплектно"));
	
	Возврат КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	
КонецФункции