
&НаСервере
Процедура ЗаполнитьПрофилиНаСервере()
	
	МассивНаименований = СтрРазделить(СписокПрофилейГруппДоступа, Символы.ПС, Ложь);
	
	Для Каждого ПрофилиГруппДоступаСтрока Из МассивНаименований Цикл
		НоваяСтрока = ПрофилиГруппДоступа.Добавить();
		НоваяСтрока.ПрофильСсылка = Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию(СокрЛП(ПрофилиГруппДоступаСтрока));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрофили(Команда)
	
	ЗаполнитьПрофилиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРольВПрофилиНаСервере()
	
	Для Каждого ПрофилиГруппДоступаСтрока Из ПрофилиГруппДоступа Цикл
		
		ПрофильОбъект = ПрофилиГруппДоступаСтрока.ПрофильСсылка.ПолучитьОбъект();
		//ПрофильОбъект = Справочники.ПрофилиГруппДоступа.СоздатьЭлемент();
		СтрокаРоль = ПрофильОбъект.Роли.Добавить();
		СтрокаРоль.Роль = Роль;
		ПрофильОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРольВПрофили(Команда)
	
	ДобавитьРольВПрофилиНаСервере();
	
КонецПроцедуры
