
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЗначениеОтбора = ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение;
	Если ТипЗнч(ЗначениеОтбора) = Тип("Строка") Тогда
		МассивСтрок = СтрРазделить(ЗначениеОтбора,".");
		МетаданныеОбъекта = Метаданные[МассивСтрок[0]][МассивСтрок[1]];	
	Иначе
		МетаданныеОбъекта = ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.Метаданные();
	КонецЕсли;
	
	//Определим роли, для которых будем искать настройки групп доступа
	СписокРолей = Новый СписокЗначений();
	Для Каждого Роль Из Метаданные.Роли Цикл
		Если ПравоДоступа(Право, МетаданныеОбъекта, Роль) Тогда
			СписокРолей.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(Роль));
		КонецЕсли;
	КонецЦикла;
	
	СхемаКомпоновкиДанных.Параметры.СписокРолей.Значение = СписокРолей;

КонецПроцедуры
