
&НаКлиенте
Процедура РедактироватьПрава(Команда)
	
	ОткрытьФорму("ВнешнийОтчет.АнализПравНаОбъект.Форма.ФормаРедактированияПрав");
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДобавитьЭлементы();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементы()
	
	ЭлементПраво = Элементы.Добавить("Право", Тип("ПолеФормы"), Элементы.КомпоновщикНастроекПользовательскиеНастройки);
	ЭлементПраво.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПраво.ПутьКДанным = "Отчет.Право";
	ЭлементПраво.РежимВыбораИзСписка = Истина;
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение.УстановитьДействие("ПриИзменении", "ОбъектПриИзменении");
	
	ЭлементПравоЗадатьСписокВыбора()
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	ЭлементПравоЗадатьСписокВыбора();
	
КонецПроцедуры

&НаСервере
Процедура ЭлементПравоЗадатьСписокВыбора();
	
	ЭлементПраво = Элементы["Право"];
	ЭлементПраво.СписокВыбора.Очистить();
	
	ЗначениеОтбора = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение;
	МассивСтрок = СтрРазделить(ЗначениеОтбора,".");
	
	Если МассивСтрок <> Неопределено И (МассивСтрок[0] = "Отчеты" Или МассивСтрок[0] = "Обработки") Тогда 
		ЭлементПраво.СписокВыбора.Добавить("Просмотр");
		ЭлементПраво.СписокВыбора.Добавить("Использование");
	Иначе
		ЭлементПраво.СписокВыбора.Добавить("Чтение");
		ЭлементПраво.СписокВыбора.Добавить("Добавление");
		ЭлементПраво.СписокВыбора.Добавить("Изменение");
		ЭлементПраво.СписокВыбора.Добавить("Редактирование");
	КонецЕсли;
		
	Отчет.Право = Элементы["Право"].СписокВыбора[0].Значение;
	
КонецПроцедуры
