
&НаСервере
Процедура ВыполнитьСозданиеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписаниеСредствИндивидуальнойЗащиты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеСредствИндивидуальнойЗащиты КАК СписаниеСредствИндивидуальнойЗащиты
	|ГДЕ
	|	СписаниеСредствИндивидуальнойЗащиты.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ВыполнитьПроверкуСписания(ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуСписания(СсылкаСписаниеСИЗ)
	
	//СсылкаСписаниеСИЗ = Документы.СписаниеСредствИндивидуальнойЗащиты.Выбрать();
	ОбъектСписаниеСИЗ = СсылкаСписаниеСИЗ.ПолучитьОбъект();
	
	Организация = СсылкаСписаниеСИЗ.Организация;
	ДатаВозврата = СсылкаСписаниеСИЗ.Дата - 1;
	
	СтрокиСОшибками = ОбъектСписаниеСИЗ.ПолучитьНомераСтрокСОшибками();
	Если СтрокиСОшибками.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСИЗ = СсылкаСписаниеСИЗ.СредстваИндивидуальнойЗащиты.Выгрузить();
	ТаблицаСИЗ.Очистить();
	
	Для Каждого НомерСтроки Из СтрокиСОшибками Цикл
		НоваяСтрока = ТаблицаСИЗ.Добавить();
		СтрокаСОшибкой = СсылкаСписаниеСИЗ.СредстваИндивидуальнойЗащиты.Найти(НомерСтроки, "НомерСтроки");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСОшибкой);
	КонецЦикла;
	
	ТаблицаСотрудники = ТаблицаСИЗ.Скопировать(,"Сотрудник");
	ТаблицаСотрудники.Свернуть("Сотрудник");
	
	Для Каждого СтрокаСотрудник Из ТаблицаСотрудники Цикл
		
		СотрудникСсылка = СтрокаСотрудник.Сотрудник; 
		
		ОбъектВозвратСИЗ = Документы.ВозвратСредствИндивидуальнойЗащиты.СоздатьДокумент();
		ОбъектВозвратСИЗ.Организация = Организация;
		ОбъектВозвратСИЗ.Дата = ДатаВозврата;
		ОбъектВозвратСИЗ.Комментарий = "Автоматически создан для документа " + СсылкаСписаниеСИЗ;
		ОбъектВозвратСИЗ.Ответственный = Пользователи.ТекущийПользователь();
		
		ДанныеОСотруднике = Справочники.Сотрудники.ПолучитьИнформациюПоСотруднику(СотрудникСсылка, ДатаВозврата); 
		
		ОбъектВозвратСИЗ.Сотрудник = СотрудникСсылка;
		ОбъектВозвратСИЗ.ЦФО = ДанныеОСотруднике.ЦФО;
		ОбъектВозвратСИЗ.Должность = ДанныеОСотруднике.Должность;
		
		ТаблицаСИЗПоСотруднику = ТаблицаСИЗ.Скопировать(Новый Структура("Сотрудник", СотрудникСсылка));
		
		Для Каждого СтрокаСИЗПоСотруднику Из ТаблицаСИЗПоСотруднику Цикл
			
			НоваяСтрокаСИЗ = ОбъектВозвратСИЗ.СредстваИндивидуальнойЗащиты.Добавить();
			
			СИЗ = СтрокаСИЗПоСотруднику.СредствоИндивидуальнойЗащиты;
			
			РеквизитыПартии = Справочники.СредстваИндивидуальнойЗащиты.ПолучитьРеквизитыПартии(СИЗ);
			
			ПараметрыОтбора = Новый Структура("СИЗ, Период", СИЗ, ДатаВозврата);
			ДанныеОбИзносе = Справочники.СредстваИндивидуальнойЗащиты.ПолучитьДанныеОбИзносе(ПараметрыОтбора);
			
			НоваяСтрокаСИЗ.СредствоИндивидуальнойЗащиты = СтрокаСИЗПоСотруднику.СредствоИндивидуальнойЗащиты;
			НоваяСтрокаСИЗ.ГруппаСредствИндивидуальнойЗащиты = РеквизитыПартии.ГруппаСредствИндивидуальнойЗащиты;
			Если ДанныеОбИзносе.Количество() > 0 Тогда
				НоваяСтрокаСИЗ.СостояниеСИЗ = ДанныеОбИзносе[0].СостояниеСИЗ;
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			ОбъектВозвратСИЗ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ОбъектВозвратСИЗ.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
	КонецЦикла;
	
	//записываем последний
	ОбъектСписаниеСИЗ.ВозвратСредствИндивидуальнойЗащиты = ОбъектВозвратСИЗ.Ссылка;
	ОбъектСписаниеСИЗ.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьСоздание(Команда)
	ВыполнитьСозданиеНаСервере();
КонецПроцедуры
