&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//УстановитьОтборПоОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоОрганизации()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ОрганизацияОтбор = Неопределено;
	
	ДополнительныйРеквизитСвойство = Справочники.ММЦ_СсылкиНаОбъекты.НайтиПоНаименованию("Основная организация").СсылкаНаОбъектБазы;
	СтрокаДополнительныйРеквизит = ТекущийПользователь.ДополнительныеРеквизиты.Найти(ДополнительныйРеквизитСвойство, "Свойство");
	Если СтрокаДополнительныйРеквизит <> Неопределено Тогда
		ОрганизацияОтбор = СтрокаДополнительныйРеквизит.Значение;	
	КонецЕсли;
	
	ИдентификаторПользовательскойНастройки = Неопределено;
	Для Каждого Элемент Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда
			ИдентификаторПользовательскойНастройки = Элемент.ИдентификаторПользовательскойНастройки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОрганизацияОтбор) И ЗначениеЗаполнено(ИдентификаторПользовательскойНастройки) Тогда
		Элемент = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = ОрганизацияОтбор;
	КонецЕсли;
	
КонецПроцедуры
