#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	ПараметрыРегистрации.Информация = НСтр("ru = 'Печатная форма ""ОС1""'");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Версия = "3.0.1.1";
	ПараметрыРегистрации.Назначение.Добавить("Документ.ПринятиеКУчетуОС");
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Печать ""ОС1"" (внешняя печатная форма)'");
	Команда.Идентификатор = "ПечатьОС1Внешняя";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

// Обработчик печати.
//
// Параметры:
//   МассивОбъектов - Массив - Ссылки на объекты, которые нужно распечатать.
//   КоллекцияПечатныхФорм - ТаблицаЗначений - Информация о табличных документах.
//       Используется для передачи в параметрах функции УправлениеПечатью.СведенияОПечатнойФорме().
//   ОбъектыПечати - СписокЗначений - Соответствие между объектами и именами областей в табличных документах.
//       Используется для передачи в параметрах процедуры УправлениеПечатью.ЗадатьОбластьПечатиДокумента().
//   ПараметрыВывода - Структура - Дополнительные параметры сформированных табличных документов.
//       * ДополнительнаяОбработкаСсылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка обработки.
//           Может использоваться для чтения параметров обработки.
//           Пример см. в комментарии к функции ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы().
//
// Пример:
//  	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "<ИдентификаторПечатнойФормы>");
//  	Если ПечатнаяФорма <> Неопределено Тогда
//  		ТабличныйДокумент = Новый ТабличныйДокумент;
//  		ТабличныйДокумент.КлючПараметровПечати = "<КлючСохраненияПараметровПечатнойФормы>";
//  		Для Каждого Ссылка Из МассивОбъектов Цикл
//  			Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
//  				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//  			КонецЕсли;
//  			НачалоОбласти = ТабличныйДокумент.ВысотаТаблицы + 1;
//  			// ... код по формированию табличного документа ...
//  			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НачалоОбласти, ОбъектыПечати, Ссылка);
//  		КонецЦикла;
//  		ПечатнаяФорма.ТабличныйДокумент = ТабличныйДокумент;
//  	КонецЕсли;
//
Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьОС1Внешняя") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьОС1Внешняя",
			НСтр("ru = 'Акт о приеме-передаче объекта ОС (ОС-1)'"),
			ПечатьОС1(МассивОбъектов, ОбъектыПечати, "ОС1"),, "ПФ_MXL_ОС1");
			
	КонецЕсли;
	
КонецПроцедуры

//Процедура заполняет параметры организации-получателя формы ОС1
Процедура ЗаполнитьДанныеОрганизацииПолучателя(ПараметрыДокумента, ОбластьМакета) Экспорт

	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ПараметрыДокумента.Организация, ПараметрыДокумента.Дата);
	ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(ПараметрыДокумента.Организация,
		ПараметрыДокумента.Дата, ПараметрыДокумента.ПодразделениеОрганизации);

	ПараметрыОрганизации = Новый Структура("ОрганизацияПолучатель, АдресПолучателя, РеквПолучателя, ДолжРукПолуч,
		|РукПолучателя, КодПоОКПОПолучателя, ГлавБухПолучателя");

	ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	ПараметрыОрганизации.ОрганизацияПолучатель = ПредставлениеОрганизации;
	ПараметрыОрганизации.АдресПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации,
		"ЮридическийАдрес,Телефоны,");
	ПараметрыОрганизации.РеквПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации,
		"НомерСчета,Банк,БИК,КоррСчет,");
	ПараметрыОрганизации.КодПоОКПОПолучателя = СведенияОбОрганизации.КодПоОКПО;

	ПараметрыОрганизации.РукПолучателя = ОтветственныеЛицаОрганизации.РуководительПредставление;
	ПараметрыОрганизации.ДолжРукПолуч = ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление;
	ПараметрыОрганизации.ГлавБухПолучателя = ОтветственныеЛицаОрганизации.ГлавныйБухгалтерПредставление;

	ОбластьМакета.Параметры.Заполнить(ПараметрыОрганизации);

КонецПроцедуры

Функция ПечатьОС1(МассивОбъектов, ОбъектыПечати, ИмяМакета)

	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПринятиеКУчетуОС_ОС1";

	// + Граховский К.Н. 2018.12.24
	//Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ОС1");
	Макет = ПолучитьМакет("ПФ_MXL_ОС1");
	// - Граховский К.Н. 2018.12.24
	МакетОС1а = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ОС1а");
	МакетОС1б = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ОС1б");

	// Области
	ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетаЗаголовок_а = МакетОС1а.ПолучитьОбласть("Заголовок");

	Шапка1ОС1б     = МакетОС1б.ПолучитьОбласть("Шапка1");
	Шапка2ОС1б     = МакетОС1б.ПолучитьОбласть("Шапка2");
	Строка2ОС1б    = МакетОС1б.ПолучитьОбласть("Строка2");
	Строка2ПОС1б   = МакетОС1б.ПолучитьОбласть("Строка2П");
	Подвал2        = МакетОС1б.ПолучитьОбласть("Подвал2");
	Шапка3ОС1б     = МакетОС1б.ПолучитьОбласть("Шапка3");
	Строка3ОС1б    = МакетОС1б.ПолучитьОбласть("Строка3");
	Строка3ПОС1б   = МакетОС1б.ПолучитьОбласть("Строка3П");
	Подвал3        = МакетОС1б.ПолучитьОбласть("Подвал3");
	Шапка4ОС1б     = МакетОС1б.ПолучитьОбласть("Шапка4");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка КАК Ссылка,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОСОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПринятиеКУчетуОСОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.АмортизационнаяГруппа.Порядок + 1 КАК НомерГруппы,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.Изготовитель КАК Изготовитель,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.ГруппаОС КАК ГруппаОС,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.КодПоОКОФ.Код КАК КодОКОФ,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.ДатаВыпуска КАК ДатаВыпуска,
	|	МАКСИМУМ(ПервоначальныеСведенияОСБухгалтерскийУчет.Период) КАК МаксПериод
	|ПОМЕСТИТЬ ВТ_МаксПериодыСведенийОСБУ
	|ИЗ
	|	Документ.ПринятиеКУчетуОС.ОС КАК ПринятиеКУчетуОСОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	|		ПО ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство = ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство
	|			И ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация = ПервоначальныеСведенияОСБухгалтерскийУчет.Организация
	|			И (ПервоначальныеСведенияОСБухгалтерскийУчет.Период <= КОНЕЦПЕРИОДА(ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата, МЕСЯЦ))
	|ГДЕ
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство,
	|	ПринятиеКУчетуОСОсновныеСредства.ИнвентарныйНомер,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.АмортизационнаяГруппа.Порядок + 1,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.Изготовитель,
	|	ПринятиеКУчетуОСОсновныеСредства.НомерСтроки,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.ГруппаОС,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.ЗаводскойНомер,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.КодПоОКОФ.Код,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство.ДатаВыпуска
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство) КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВТ_ПринятиеКУчетуОС_КоличествоОС
	|ИЗ
	|	ВТ_МаксПериодыСведенийОСБУ КАК ПринятиеКУчетуОСОсновныеСредства
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументПринятиеКУчетуОС.Ссылка КАК Ссылка,
	|	ДокументПринятиеКУчетуОС.Номер КАК НомерАкта,
	|	ДокументПринятиеКУчетуОС.Дата КАК Дата,
	|	ДокументПринятиеКУчетуОС.Дата КАК ДатаВвода,
	|	ДокументПринятиеКУчетуОС.Дата КАК ДатаВводаПриПередаче,
	|	ДокументПринятиеКУчетуОС.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|	ДокументПринятиеКУчетуОС.МОЛБУ КАК МОЛБУ,
	|	ДокументПринятиеКУчетуОС.ГодоваяНормаАмортизацииБУ КАК НормаАморт,
	|	ДокументПринятиеКУчетуОС.Ответственный КАК Ответственный,
	|	ДокументПринятиеКУчетуОС.МестонахождениеОС КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА ДокументПринятиеКУчетуОС.МестонахождениеОС.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА ДокументПринятиеКУчетуОС.МестонахождениеОС.Наименование
	|		ИНАЧЕ ДокументПринятиеКУчетуОС.МестонахождениеОС.НаименованиеПолное
	|	КОНЕЦ КАК ПодрПолучателя,
	|	ДокументПринятиеКУчетуОС.Склад КАК Склад,
	|	ДокументПринятиеКУчетуОС.СпособПоступления КАК СпособПоступления,
	|	ДокументПринятиеКУчетуОС.СрокПолезногоИспользованияБУ КАК СрокПолезнИспПриПост,
	// + Граховский К.Н. 2018.12.24
	|	ДокументПринятиеКУчетуОС.СрокПолезногоИспользованияНУ КАК СрокПолезнИспПриПостНУ,
	// - Граховский К.Н. 2018.12.24
	|	ДокументПринятиеКУчетуОС.СтоимостьБУ КАК СтоимостьБУ,
	|	ДокументПринятиеКУчетуОС.СпособНачисленияАмортизацииБУ КАК СпособАмортизации,
	|	ДокументПринятиеКУчетуОС.Организация КАК Организация,
	|	ДокументПринятиеКУчетуОС.СчетУчета КАК СчетУчетаОС,
	|	ЕСТЬNULL(Сведения.ИнвентарныйНомер, ВТ_МаксПериодыСведенийОСБУ.ИнвентарныйНомер) КАК ИнвНомер,
	|	ЕСТЬNULL(Сведения.ПервоначальнаяСтоимость, 0) КАК НачСтоимость,
	|	ВТ_МаксПериодыСведенийОСБУ.НомерГруппы КАК НомерГруппы,
	|	ВТ_МаксПериодыСведенийОСБУ.Изготовитель КАК Изготовитель,
	|	ВТ_МаксПериодыСведенийОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_МаксПериодыСведенийОСБУ.НомерСтроки КАК НомерСтроки,
	|	ВТ_МаксПериодыСведенийОСБУ.ГруппаОС КАК ГруппаОС,
	|	ВТ_МаксПериодыСведенийОСБУ.НаименованиеОС КАК НаименованиеОС,
	|	ВТ_МаксПериодыСведенийОСБУ.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ВТ_МаксПериодыСведенийОСБУ.ДатаВыпуска КАК ГодВыпуска,
	|	ВТ_МаксПериодыСведенийОСБУ.КодОКОФ КАК КодОКОФ,
	|	ЕСТЬNULL(ПринятиеКУчетуОС.КоличествоСтрок, 0) КАК КоличествоСтрок
	|ИЗ
	|	Документ.ПринятиеКУчетуОС КАК ДокументПринятиеКУчетуОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПринятиеКУчетуОС_КоличествоОС КАК ПринятиеКУчетуОС
	|		ПО ДокументПринятиеКУчетуОС.Ссылка = ПринятиеКУчетуОС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксПериодыСведенийОСБУ КАК ВТ_МаксПериодыСведенийОСБУ
	|		ПО ДокументПринятиеКУчетуОС.Ссылка = ВТ_МаксПериодыСведенийОСБУ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК Сведения
	|		ПО (ВТ_МаксПериодыСведенийОСБУ.ОсновноеСредство = Сведения.ОсновноеСредство)
	|			И (ВТ_МаксПериодыСведенийОСБУ.Организация = Сведения.Организация)
	|			И (ВТ_МаксПериодыСведенийОСБУ.МаксПериод = Сведения.Период)
	|ГДЕ
	|	ДокументПринятиеКУчетуОС.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка,
	|	НомерСтроки";

	ВыборкаПоОС = Запрос.Выполнить().Выбрать();

	ПервыйДокумент = Истина;

	Пока ВыборкаПоОС.СледующийПоЗначениюПоля("Ссылка") Цикл

		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;

		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		Если ВыборкаПоОС.КоличествоСтрок <= 1 Тогда

			ВыборкаПоОС.Следующий();

			Если НЕ(ВыборкаПоОС.ГруппаОС = Перечисления.ГруппыОС.Здания ИЛИ
				ВыборкаПоОС.ГруппаОС = Перечисления.ГруппыОС.Сооружения) Тогда
				
				Если ИмяМакета <> "ОС1" Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьМакетаЗаголовок.Параметры.Заполнить(ВыборкаПоОС);
				Если ПустаяСтрока(ВыборкаПоОС.НаименованиеОС) Тогда
					ОбластьМакетаЗаголовок.Параметры.НаименованиеОС = СокрЛП(ВыборкаПоОС.ОсновноеСредство);
				КонецЕсли;

				ЗаполнитьДанныеОрганизацииПолучателя(ВыборкаПоОС, ОбластьМакетаЗаголовок);
				
				ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(ВыборкаПоОС.Организация,ВыборкаПоОС.МОЛБУ,ВыборкаПоОС.Дата);
				ОбластьМакетаЗаголовок.Параметры.МОЛДолжность = ДанныеФизЛица.Должность;
				ОбластьМакетаЗаголовок.Параметры.МОЛРасшифровкаПодписи = ДанныеФизЛица.Представление;

				ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);

			Иначе
				
				Если ИмяМакета <> "ОС1а" Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьМакетаЗаголовок_а.Параметры.Заполнить(ВыборкаПоОС);
				Если ПустаяСтрока(ВыборкаПоОС.НаименованиеОС) Тогда
					ОбластьМакетаЗаголовок_а.Параметры.НаименованиеОС = СокрЛП(ВыборкаПоОС.ОсновноеСредство);
				КонецЕсли;

				ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(ВыборкаПоОС.Организация,ВыборкаПоОС.МОЛБУ,ВыборкаПоОС.Дата);
				ОбластьМакетаЗаголовок_а.Параметры.МОЛДолжность = ДанныеФизЛица.Должность;
				ОбластьМакетаЗаголовок_а.Параметры.МОЛРасшифровкаПодписи = ДанныеФизЛица.Представление;
				
				ЗаполнитьДанныеОрганизацииПолучателя(ВыборкаПоОС, ОбластьМакетаЗаголовок_а);
				ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок_а);

			КонецЕсли;

		Иначе // Объектов много - групповая печать.

			Если ИмяМакета <> "ОС1б" Тогда
				Продолжить;
			КонецЕсли;
			
			ОС1б_Страница1 = Новый ТабличныйДокумент();
			ОС1б_Страница2 = Новый ТабличныйДокумент();
			ОС1б_Страница3 = Новый ТабличныйДокумент();
			ОС1б_Страница4 = Новый ТабличныйДокумент();

			Шапка1ОС1б.Параметры.Заполнить(ВыборкаПоОС);
			ЗаполнитьДанныеОрганизацииПолучателя(ВыборкаПоОС, Шапка1ОС1б);
			ОС1б_Страница1.Вывести(Шапка1ОС1б);

			Шапка2ОС1б.Параметры.Заполнить(ВыборкаПоОС);
			ОС1б_Страница2.Вывести(Шапка2ОС1б);

			Шапка3ОС1б.Параметры.Заполнить(ВыборкаПоОС);
			ОС1б_Страница3.Вывести(Шапка3ОС1б);

			Шапка4ОС1б.Параметры.Заполнить(ВыборкаПоОС);
			ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(ВыборкаПоОС.Организация,ВыборкаПоОС.МОЛБУ,ВыборкаПоОС.Дата);
			Шапка4ОС1б.Параметры.МОЛДолжность = ДанныеФизЛица.Должность;
			Шапка4ОС1б.Параметры.МОЛРасшифровкаПодписи = ДанныеФизЛица.Представление;			
			ОС1б_Страница4.Вывести(Шапка4ОС1б);

			НомПП            = 0;
			ИтогНачСтоимость = 0;

			Пока ВыборкаПоОС.Следующий() Цикл

				ИтогНачСтоимость = ИтогНачСтоимость + ВыборкаПоОС.НачСтоимость;

				НомПП = НомПП + 1;
				Строка2ОС1б.Параметры.Нс = НомПП;

				Строка2ОС1б.Параметры.Заполнить(ВыборкаПоОС);
				Если ПустаяСтрока(ВыборкаПоОС.НаименованиеОС) Тогда
					Строка2ОС1б.Параметры.НаименованиеОС = СокрЛП(ВыборкаПоОС.ОсновноеСредство);
				КонецЕсли;
				ОС1б_Страница2.Вывести(Строка2ОС1б);

				Строка3ОС1б.Параметры.Заполнить(ВыборкаПоОС);
				ОС1б_Страница3.Вывести(Строка3ОС1б);

			КонецЦикла;

			Строка2ПОС1б.Параметры.Заполнить(ВыборкаПоОС);
			ОС1б_Страница2.Вывести(Строка2ПОС1б);

			Подвал2.Параметры.Заполнить(ВыборкаПоОС);
			ОС1б_Страница2.Вывести(Подвал2);

			Строка3ПОС1б.Параметры.Заполнить(ВыборкаПоОС);
			ОС1б_Страница3.Вывести(Строка3ПОС1б);

			Подвал3.Параметры.Заполнить(ВыборкаПоОС);
			Подвал3.Параметры.ИтогНачСтоимость = ИтогНачСтоимость;
			ОС1б_Страница3.Вывести(Подвал3);

			ТабличныйДокумент.Вывести(ОС1б_Страница1);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(ОС1б_Страница2);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(ОС1б_Страница3);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(ОС1б_Страница4);
		КонецЕсли;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоОС.Ссылка);

	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли