
Функция ПолучитьСтрокуЗапуска(СтруктураПараметровИБ)
	
	ИмяФайла = """" + КаталогПрограммы() + "1cv8s.exe" + """";
	
	Если СтруктураПараметровИБ.ТипРасположения = "Серверная" Тогда;
		СтрокаПодключения = "/S " + """" + СтруктураПараметровИБ.КластерСерверов1СПредприятия + "\" + СтруктураПараметровИБ.ИмяИнформационнойБазы + """";		
	Иначе		
		СтрокаПодключения = "/F " + """" + СтруктураПараметровИБ.ПутьКБазе + """";
	КонецЕсли;
	
	ПараметрыПодключения = "/N " + """" + СтруктураПараметровИБ.ИмяПользователя + """" + " " +  
	?(ЗначениеЗаполнено(СтруктураПараметровИБ.ПарольПользователя), "/P " + """" + СтруктураПараметровИБ.ПарольПользователя + """" + " ", "");	
	
	
	ПараметрыФайлОбработки = "";
	Если ЗначениеЗаполнено(СтруктураПараметровИБ.ФайлОбработки) Тогда
		ПараметрыФайлОбработки = "/Execute " + СтруктураПараметровИБ.ФайлОбработки;
	КонецЕсли;
	
	ПараметрыЗапуска = "";
	Если ЗначениеЗаполнено(СтруктураПараметровИБ.КаталогФайлов) Тогда
		ПараметрыЗапуска = "/C " + """" + СтруктураПараметровИБ.КаталогФайлов + """";
	КонецЕсли;
	
	ДополнительныеПараметрыЗапуска = "/DisableStartupDialogs /DisableStartupMessages";
	
	СтрокаЗапуска = 
	ИмяФайла + " " +
	СтрокаПодключения + " " +
	ПараметрыПодключения + " " +	
	ПараметрыФайлОбработки + " " +
	ПараметрыЗапуска + " " +
	ДополнительныеПараметрыЗапуска;
	Возврат СтрокаЗапуска;
	
КонецФункции

Процедура ВыполнитьЗапуск(СтруктураПараметровИБ) Экспорт
	
	СтрокаЗапуска = ПолучитьСтрокуЗапуска(СтруктураПараметровИБ);
	Попытка
		ЗапуститьПриложение(СтрокаЗапуска);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

//добавляем в репо, меняем еще