Перем мCOMОбъектConnection Экспорт;
 

#Область ПодключениеКДополнительнымОтчетамИОбработкам

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение", ""); // Для глобальных обработок не используется
	ПараметрыРегистрации.Вставить("Наименование", "Загрузка из Медиалога");
	ПараметрыРегистрации.Вставить("Версия", "7.0");
	ПараметрыРегистрации.Вставить("Информация", "Загрузка из Медиалога документов");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4");
	Команды = ТаблицаКоманд();
	ДобавитьКоманду(Команды,
	      "Загрузка из Медиалога",
	      "ЗагрузкаИзМедиалога",
	      "ОткрытиеФормы",
	      Ложь,
	      "");
	ПараметрыРегистрации.Вставить("Команды", Команды);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);

	Возврат ПараметрыРегистрации;
  
КонецФункции

Функция ТаблицаКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
  
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаССоединениями
	
Функция ПолучитьСоединение() Экспорт
	
	Если мCOMОбъектConnection = Неопределено Тогда
		
		ТаблицаСоединений = ПолучитьТаблицуСоединений();
		Если ТаблицаСоединений.Количество()=0 Тогда
			ВывестиСообщение("Не определены соединения");
			мCOMОбъектConnection = Неопределено;
			Возврат мCOMОбъектConnection;
		//КонецЕсли;
		
		//////ИначеЕсли ТаблицаСоединений.Количество()=1 Тогда
		//////	ТекСоединение = ТаблицаСоединений[0];
		//////Иначе
		//////	Меню = Новый СписокЗначений;
		//////	Для каждого СтрокаТЗ Из ТаблицаСоединений Цикл
		//////		Меню.Добавить(СтрокаТЗ, СтрокаТЗ.Имя);
		//////	КонецЦикла;
		//////	РезультатВыбора = Меню.ВыбратьЭлемент();
		//////	Если РезультатВыбора = Неопределено Тогда
		//////		мCOMОбъектConnection = Неопределено;
		//////		Возврат мCOMОбъектConnection;
		//////	КонецЕсли; 
		//////	ТекСоединение = РезультатВыбора.Значение;	
		КонецЕсли; 
		
		ТекСоединение = ТаблицаСоединений[0];
		
		СтрокаСоединения="Driver={SQL Server};Server="+ТекСоединение.Сервер+";Database="+ТекСоединение.База+";Uid="+ТекСоединение.Юзер+";Pwd="+ТекСоединение.Пароль;//+";";

		Попытка
			
			ВывестиСообщение("Установка соединения");
			
			мCOMОбъектConnection = Новый COMОбъект("ADODB.Connection");
			мCOMОбъектConnection.ConnectionTimeout = 1800;
			мCOMОбъектConnection.CommandTimeOut = 2400;
		    мCOMОбъектConnection.Open(СтрокаСоединения);  
			
			ВывестиСообщение("Соединение установлено");
			
		Исключение
			Сообщить(ОписаниеОшибки());
			мCOMОбъектConnection = Неопределено;
			
		КонецПопытки;
		
		Возврат мCOMОбъектConnection;
	
	Иначе
		Возврат мCOMОбъектConnection;	
	КонецЕсли;	
	
КонецФункции // ПолучитьСоединение()

Процедура ВывестиСообщение(ТекстСообщения) Экспорт
	
	Если ВыводитьСообщения Тогда
	
		Сообщить(ТекстСообщения);	
	
	КонецЕсли; 
	
КонецПроцедуры // ВывестиСообщение()

Функция ПолучитьТаблицуСоединений() Экспорт

	ТаблицаСоединений = Новый ТаблицаЗначений;
	ТаблицаСоединений.Колонки.Добавить("Имя");
	ТаблицаСоединений.Колонки.Добавить("Сервер");
	ТаблицаСоединений.Колонки.Добавить("База");
	ТаблицаСоединений.Колонки.Добавить("Юзер");
	ТаблицаСоединений.Колонки.Добавить("Пароль");
	
	Макет = ПолучитьМакет("Соединения");
	
	Счетчик = 0;
	Пока 1=1 Цикл
	
		Счетчик = Счетчик + 1;
		О = Макет.ПолучитьОбласть("R"+Счетчик+"C"+1);
		ТекстОбласти = СокрЛП(О.ТекущаяОбласть.Текст);
		
		Если ПустаяСтрока(ТекстОбласти) Тогда
			Прервать;
		КонецЕсли; 
		
		НоваяСтрока = ТаблицаСоединений.Добавить();
		НоваяСтрока.Имя = ТекстОбласти;
		
		О = Макет.ПолучитьОбласть("R"+Счетчик+"C"+2);
		НоваяСтрока.Сервер = СокрЛП(О.ТекущаяОбласть.Текст);
		
		О = Макет.ПолучитьОбласть("R"+Счетчик+"C"+3);
		НоваяСтрока.База = СокрЛП(О.ТекущаяОбласть.Текст);
		
		О = Макет.ПолучитьОбласть("R"+Счетчик+"C"+4);
		НоваяСтрока.Юзер = СокрЛП(О.ТекущаяОбласть.Текст);
		
		О = Макет.ПолучитьОбласть("R"+Счетчик+"C"+5);
		НоваяСтрока.Пароль = СокрЛП(О.ТекущаяОбласть.Текст);
		
	КонецЦикла; 
		
	Возврат ТаблицаСоединений;		
	
КонецФункции // ПолучитьТаблицуСоединений()

Процедура ЗакрытьСоединение() Экспорт

	Попытка
	
		мCOMОбъектConnection.Close();	
	
	Исключение	
	КонецПопытки;	
	
	мCOMОбъектConnection=Неопределено;

КонецПроцедуры
 
#КонецОбласти