&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Массив = Новый Массив();
	Массив.Добавить(Тип("ДокументСсылка.ПринятиеКУчетуОС"));
	СсылкаНаОбъектОписаниеТипов = Новый ОписаниеТипов(Массив);
	Элементы.СсылкаНаОбъект.ОграничениеТипа = СсылкаНаОбъектОписаниеТипов;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПечатнуюФорму(Команда)
	
	ТабличныйДокумент = СформироватьНаСервере();
	Если ТабличныйДокумент <> Неопределено Тогда
		ТабличныйДокумент.Показать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(СсылкаНаОбъект);
	
	ОбъектыПечати = Новый СписокЗначений();
	
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений();
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	
	СтрокаКоллекцияПечатныхФорм = КоллекцияПечатныхФорм.Добавить();
	СтрокаКоллекцияПечатныхФорм.ИмяВРЕГ = ВРЕГ("ПечатьОС1Внешняя");
	
	РеквизитФормыВЗначение("Объект").Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, Новый Структура("ДоступнаПечатьПоКомплектно"));
	
	Возврат КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	
КонецФункции

